[
    {
        "name":"Weather App", 
        "img" : "/images/projects/weather.webp", 
        "description": "The application features an intuitive interface where users can input the name of a specific city to retrieve the corresponding weather information. By utilizing the WEATHER API, the application can access real-time data and provide details such as the current temperature, feels like temperature, weather description, humidity, wind speed, and more.", 
        "link": "https://weather-app-wizz.netlify.app/",
        "github": "https://github.com/LuisEnrique25/WeatherApp"
    },
    {
        "name":"Usuarios", 
        "img" : "/images/projects/usuarios.webp", 
        "description": "The application not only provides an efficient and convenient way to display, register, delete, and edit users but also seamlessly integrates with an existing API. This allows the application to connect and fetch data from an external source, adding flexibility and scalability to user management.", 
        "link": "https://users-form-wizz.netlify.app/",
        "github": "https://github.com/LuisEnrique25/form"
    },
    {
        "name":"Wiki Spartans", 
        "img" : "/images/projects/spartans.webp", 
        "description": "Upon opening the application, users are greeted with a visually appealing interface where they can press a button to generate a random Spartan. Each time the button is pressed, a different Spartan is displayed along with their image and a detailed description.", 
        "link": "https://spartans-characters-wiiz.netlify.app/",
        "github": "https://github.com/LuisEnrique25/spartans"
    },
    {
        "name":"Rick&Morty App", 
        "img" : "/images/projects/rick.webp", 
        "description": "The app is a comprehensive tool that provides information about different locations in the Rick&Morty series. Users can explore various locales along with details such as the type of locality, the dimension it exists in, and the population. Additionally, the app offers an interactive feature that displays all the characters associated with each location.", 
        "link": "https://rick-and-morty-wizz.netlify.app/",
        "github": "https://github.com/LuisEnrique25/rick-and-morty"
    },
    {
        "name":"Pokedex App", 
        "img" : "/images/projects/pokeApp.webp", 
        "description": "The Pokedex App is a comprehensive tool to discover and explore the vast variety of Pokémon. With its login authentication, filtering, and search options, it provides users with an interactive and personalized experience to delve into the captivating world of Pokémon.", 
        "link": "https://pokedex-app-wizz.netlify.app/",
        "github": "https://github.com/LuisEnrique25/pokeApp"
    }
]